cs290-02-sp23-hw-hw7-hw7-goalmatic-sl706/hw7/goalmatic-sl706/app/controllers/challenges_controller.rb

SELECT "challenges".* FROM "challenges"
---
  def index
    @challenges = Challenge.all

INSERT INTO "challenges" ("name", "category_id", "goal", "progress", "ends_at", "created_at", "updated_at", "units", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @challenge = current_user.challenges.new(challenge_params)

    respond_to do |format|
      if @challenge.save

UPDATE "challenges" SET "progress" = ?, "updated_at" = ? WHERE "challenges"."id" = ?  [["progress", 2], ["updated_at", "2023-02-09 03:24:10.237747"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @challenge.update(challenge_params)

DELETE FROM "challenges" WHERE "challenges"."id" = ?  [["id", 2]]
---
  def destroy
    @challenge.destroy

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_challenge
      @challenge = Challenge.find(params[:id])