cs290-02-sp23-hw-hw7-hw7-goalmatic-sl706/hw7/goalmatic-sl706/app/views/home/index.html.erb


  <% if current_user.badge_awards.present? %>
---
SELECT "badge_awards".* FROM "badge_awards" WHERE "badge_awards"."user_id" = ?  [["user_id", 2]]