cs290-02-sp23-hw-hw7-hw7-goalmatic-sl706/app/controllers/activities_controller.rb

INSERT INTO "activities" ("note", "amount", "challenge_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["note", "lamb"], ["amount", 1], ["challenge_id", 1], ["created_at", "2023-02-25 07:48:51.629354"], ["updated_at", "2023-02-25 07:48:51.629354"], ["user_id", 1]]
---
  def create
    @activity = @challenge.activities.build(activity_params)
    @activity.user = current_user

    respond_to do |format|
      if @activity.save

UPDATE "activities" SET "challenge_id" = ?, "updated_at" = ? WHERE "activities"."id" = ?  [["challenge_id", 2], ["updated_at", "2023-02-15 08:10:38.167096"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @activity.update(activity_params)

DELETE FROM "activities" WHERE "activities"."id" = ?  [["id", 1]]
---
  def destroy
    @activity.destroy

SELECT "activities".* FROM "activities" WHERE "activities"."challenge_id" = ? AND "activities"."id" = ? LIMIT ?  [["challenge_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_activity
      @activity = @challenge.activities.find(params[:id])

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_challenge
      @challenge = Challenge.find(params[:challenge_id])