cs290-02-sp23-hw-hw7-hw7-goalmatic-sl706/app/controllers/badges_controller.rb

SELECT "badges".* FROM "badges"
---
  def index
    @badges = Badge.all

INSERT INTO "badges" ("name", "description", "category_id", "count", "goal_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @badge = Badge.new(badge_params)

    respond_to do |format|
      if @badge.save

UPDATE "badges" SET "name" = ?, "category_id" = ?, "count" = ?, "goal_type" = ?, "updated_at" = ? WHERE "badges"."id" = ?  [["name", "study2"], ["category_id", 2], ["count", 10], ["goal_type", "BadgeGoals::DoubleProgressGoal"], ["updated_at", "2023-03-05 20:54:43.115439"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @badge.update(badge_params)

DELETE FROM "badges" WHERE "badges"."id" = ?  [["id", 5]]
---
  def destroy
    @badge.destroy

SELECT "badges".* FROM "badges" WHERE "badges"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_badge
      @badge = Badge.find(params[:id])