cs290-02-sp23-hw-hw7-hw7-goalmatic-sl706/app/controllers/categories_controller.rb

    def create
      @category = Category.new(category_params)

      respond_to do |format|
        if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "happylamb"], ["created_at", "2023-02-08 22:42:05.104418"], ["updated_at", "2023-02-08 22:42:05.104418"]]

    def update
      respond_to do |format|
        if @category.update(category_params)
---
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "happylamb1"], ["updated_at", "2023-02-08 22:57:21.912383"], ["id", 2]]