cs290-02-sp23-hw-hw7-hw7-goalmatic-sl706/app/controllers/challenges_controller.rb

INSERT INTO "challenges" ("name", "category_id", "goal", "progress", "ends_at", "created_at", "updated_at", "units") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["name", "k"], ["category_id", 10], ["goal", 0], ["progress", 0], ["ends_at", nil], ["created_at", "2023-02-16 02:22:43.440410"], ["updated_at", "2023-02-16 02:22:43.440410"], ["units", "hours"]]
---
  def create
    @challenge = current_user.challenges.new(challenge_params)

    respond_to do |format|
      if @challenge.save

UPDATE "challenges" SET "goal" = ?, "updated_at" = ?, "units" = ? WHERE "challenges"."id" = ?  [["goal", 7], ["updated_at", "2023-02-15 08:20:16.878549"], ["units", "hours"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @challenge.update(challenge_params)

DELETE FROM "challenges" WHERE "challenges"."id" = ?  [["id", 5]]
---
  def destroy
    @challenge.destroy

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_challenge
      @challenge = Challenge.find(params[:id])