goalmaticApp/app/controllers/activities_controller.rb

INSERT INTO "activities" ("name", "challenge_id", "created_at", "updated_at", "amount") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["challenge_id", 3], ["created_at", "2023-02-16 04:24:21.611521"], ["updated_at", "2023-02-16 04:24:21.611521"], ["amount", 0]]
---
  def create
    @activity = @challenge.activities.build(activity_params)
    @activity.user = current_user

    respond_to do |format|
      if @activity.save

DELETE FROM "activities" WHERE "activities"."id" = ?  [["id", 3]]
---
  def destroy
    @activity.destroy

SELECT "activities".* FROM "activities" WHERE "activities"."challenge_id" = ? AND "activities"."id" = ? LIMIT ?  [["challenge_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_activity
      @activity = @challenge.activities.find(params[:id])

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_challenge
      @challenge = Challenge.find(params[:challenge_id])