goalmaticApp/app/controllers/categories_controller.rb

   def index # get categories
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

   def create # post categories/:id
        @category = Category.new(category_params)

        respond_to do |format|
            if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Sleep"], ["created_at", "2023-02-08 22:45:41.706502"], ["updated_at", "2023-02-08 22:45:41.706502"]]

   def destroy # delete categories/:id
        @category.destroy
---
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 1]]

    def set_category # common setup
        @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]