goalmaticApp/app/views/challenges/show.html.erb

SELECT "activities".* FROM "activities" WHERE "activities"."challenge_id" = ?  [["challenge_id", 2]]
---
    <ul class="block">
      <% @challenge.activities.each do |activity| %>