cs290-02-sp23-hw-hw7-hw7-goalmatic-sl706/app/views/badges/_form.html.erb

SELECT "categories".* FROM "categories"
---
  <%= form.label :category_id %>
  <%= form.collection_select :category_id, Category.all, :id, :name, { prompt: true }, { class: "block shadow rounded-md border border-gray-200 outline-none px-3 py-2 mt-2 w-full" } %>