cs290-02-sp23-hw-hw7-hw7-goalmatic-sl706/hw7/goalmatic-sl706/app/services/badge_award_service.rb

    def self.award_badges(activity)
      Badge.all.each do |badge|
        next unless badge.awardable?(activity)
        BadgeAward.create! badge: badge, user: activity.user
---
SELECT "badges".* FROM "badges"
INSERT INTO "badge_awards" ("badge_id", "user_id", "challenge_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["badge_id", 1], ["user_id", 2], ["challenge_id", nil], ["created_at", "2023-03-20 06:28:33.162794"], ["updated_at", "2023-03-20 06:28:33.162794"]]